---
kind: other
id: Methods.T:Autodesk.Revit.DB.Outline
source: html/84b90171-ddd2-1ac0-d0f2-26dffb40932a.htm
---
# Outline Methods

Adds a point to the bounding box, expanding it if the point is outside the existing boundary.